fate-note.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-26 周六 21:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>FATE: 一种联邦学习框架</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liangzid" />
<link rel="stylesheet" type="text/css" href="./css/worg.css" />
</head>
<body>
<div id="content">
<h1 class="title">FATE: 一种联邦学习框架</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org34a7c94">1. 联邦学习基本概念</a></li>
<li><a href="#org5c0973d">2. 安装</a></li>
<li><a href="#orgd60b0ec">3. FATE总览</a></li>
<li><a href="#org8db14f9">4. fate demo测试</a></li>
</ul>
</div>
</div>

<div id="outline-container-org34a7c94" class="outline-2">
<h2 id="org34a7c94"><span class="section-number-2">1</span> 联邦学习基本概念</h2>
<div class="outline-text-2" id="text-1">
<p>
之前听学长讲过关于联邦学习的汇报，但后来发现该报告无法cover阅读文档时所出现的问题，因此还是需要自己再补充一些知识。
</p>

<p>
根据目前的学习，联邦学习目前可以分成三部分：横向联邦学习、纵向联邦学习和联邦迁移学习。
经典的联邦学习的思路是，在本地进行模型训练，将训练过程中的梯度信息回传到服务器（或互相传递），从而实现无数据沟通下的模型整体更新。
下面基于该概念理解上述所说的三个部分。
</p>

<p>
首先是横向和纵向的问题，这主要是针对于数据讨论的。可以想象一个坐标轴，横轴代表数据的特征，纵轴代表每个特征下数据的个数。
如此一来，整张图便是数据的特征分布图。针对于这张图，如果x轴不变，尝试通过多机机制实现对y轴的扩充，也就是在保持特征空间不变的前提下扩充样本数目，那么就是纵向联邦学习；
与之相反，如果样本数目是充足的，重点在于通过扩展样本表达使得模型可以覆盖更广的特征空间，那么这种联邦学习就是横向的。
</p>

<p>
如此来看，横向和纵向应对的场景是：横向更偏向那些做同样事情的节点的增多；而纵向偏向对有不同侧重的节点的聚合。
那么，什么是联邦迁移学习呢？
</p>

<p>
联邦迁移学习就是，多机上的数据，一方面特征空间不同，另一方面数量都是稀缺的。换而言之：我们既需要用他们去扩展样本空间分布，也需要用他们去提升每一个分布点下的样本数。
再换句话说，就是又要横向，又要纵向。
</p>

<p>
FATE就是这样的一个框架。
</p>
</div>
</div>

<div id="outline-container-org5c0973d" class="outline-2">
<h2 id="org5c0973d"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
<p>
官网提供了两种安装方式，即单机安装与集群安装。从这里了解到<a href="https://fate.fedai.org/install/">细节</a>。
笔者没有集群，先考察<a href="https://github.com/FederatedAI/FATE/tree/master/standalone-deploy">单机安装模式</a>。单机安装模式中推荐方法是实用docker。
</p>

<p>
docker即容器技术，也是目前最常用的解决系统环境依赖的解决方案，可以理解成系统层面的environment box。
关于对docker的具体介绍，可以参照<a href="https://docs.docker.com/get-started/">这里</a>，也可以查看之前的笔记。总而言之，当<a href="https://docs.docker.com/get-started/">安装docker</a>完成之后，剩下的任务就是下载对应的image，然后安装使用了。
</p>

<p>
这一部分操作包括以下几个部分：
</p>
<div class="org-src-container">
<pre class="src src-bash">
<span style="color: #204A87;">## </span><span style="color: #204A87;">install</span>
<span style="color: #204A87;">#</span><span style="color: #204A87;">Get code</span>
wget https://webank-ai-1251170195.cos.ap-guangzhou.myqcloud.com/docker_standalone_fate_$<span style="color: #707183;">{</span><span style="color: #0084C8; font-weight: bold;">version</span><span style="color: #707183;">}</span>.tar.gz
tar -xzvf docker_standalone_fate_$<span style="color: #707183;">{</span><span style="color: #0084C8; font-weight: bold;">version</span><span style="color: #707183;">}</span>.tar.gz

<span style="color: #204A87;">#</span><span style="color: #204A87;">Execute the command</span>
<span style="color: #A020F0;">cd</span> docker_standalone_fate_$<span style="color: #707183;">{</span><span style="color: #0084C8; font-weight: bold;">version</span><span style="color: #707183;">}</span>
bash install_standalone_docker.sh

<span style="color: #204A87;"># </span><span style="color: #204A87;">where ${version} should be replaced into docker version.</span>


<span style="color: #204A87;">## </span><span style="color: #204A87;">unit test</span>
<span style="color: #0084C8; font-weight: bold;">CONTAINER_ID</span>=<span style="color: #ff00ff;">`docker ps -aqf "name=fate"`</span>
docker exec -t -i $<span style="color: #707183;">{</span><span style="color: #0084C8; font-weight: bold;">CONTAINER_ID</span><span style="color: #707183;">}</span> bash
bash ./python/federatedml/test/run_test.sh

<span style="color: #204A87;">## </span><span style="color: #204A87;">install more tool</span>
 pip install fate-client
 pip install fate-test

<span style="color: #204A87;">## </span><span style="color: #204A87;">see the fateboard access via browser with http://hostip:8080</span>
</pre>
</div>

<p>
如此一来，基本上fate就安装完成了。是不是也没有什么可怕的？
</p>
</div>
</div>

<div id="outline-container-orgd60b0ec" class="outline-2">
<h2 id="orgd60b0ec"><span class="section-number-2">3</span> FATE总览</h2>
<div class="outline-text-2" id="text-3">
<p>
根据<a href="https://fate.fedai.org/overview/">官网</a>的介绍，fate主要包括以下几个大的板块：
</p>

<ol class="org-ol">
<li>FederatedML: 顾名思义，做机器学习的。</li>
<li>FATE Serving：提供联邦学习算法（模型）的。</li>
<li>FATEFlow：提供pipeline的。</li>
<li>FATEBoard：做前端的，类似于tensorboard之于tensorflow。</li>
<li>Federated Network: 不详。</li>
<li>KubeFATE：听名字可以看出来，但是我不懂。</li>
</ol>

<p>
不妨先根据fate的demo进行测试
</p>
</div>
</div>
<div id="outline-container-org8db14f9" class="outline-2">
<h2 id="org8db14f9"><span class="section-number-2">4</span> fate demo测试</h2>
<div class="outline-text-2" id="text-4">
<p>
目前fate支持两个版本，官方支持使用v2,因此后续就以v2为例子进行。注意：即使官方版本是1.x.x版本（例如我使用时官方推荐版本是1.6.1），也是可以使用v2的！
</p>

<p>
官方的v2版本demo是无法直接运行的（直接运行会报错）。我怀疑可能是开发者为了测试我的开发能力。此处测试的demo是AI界的hello word，即在minist数据集上用Alexnet训练一个图像数字判别器。链接在<a href="https://github.com/FederatedAI/FATE/tree/master/examples/dsl/v2/homo_nn/mnist_demo">这里</a>。
</p>

<p>
（被叫去开会了，有空补充！~）
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Sat Sep 18 20:55:59 2021</p>
<p class="author">Author: liangzid</p>
<p class="date">Created: 2022-03-26 周六 21:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
